app/controllers/api/videos_controller.rb

SELECT "videos".* FROM "videos"
---
    def index
        @videos = Video.all.with_attached_thumbnail.order(Arel.sql('RANDOM()'))