app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Ru0d7rGdToTIs4m2TdLWSQ"], ["updated_at", "2020-03-06 22:05:21.028425"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!